INIT_MESSAGE = """
👋 Всем привет, друзья!

Я ваш бот-помощник, готовый сделать ваше общение ещё увлекательнее! 🎉  
Но для этого мне нужны права администратора в этом чате. 🛡  

✨ Почему это важно?  
- 🛠 Буду управлять сообщениями, чтобы поддерживать порядок.  
- 🗳 Помогу организовать голосования и игры!  

👉 Пожалуйста, добавьте меня в администраторы, чтобы я смог работать на полную мощность!  
Спасибо за доверие, и давайте начнём наше общение! 🚀
"""  # noqa: E501

IDLE_COMMANDS_MESSAGE = """
📚Вот список доступных команд:
- 🛠 /help — показать помощь
- ❓ /rules — узнать правила
- ⌨️ /keyboard - получить клавиатуру
Попробуй, это просто! 😉
"""

IDLE_RULES_MESSAGE = """
📜 Правила игры 🎮

✨ Как играть:
1️⃣ Начало игры:
   - Нажмите на кнопку: Начать игру.

2️⃣ Раунд:
   - 📸 каждом раунде на голосование выставляются две фотографии.

3️⃣ Голосование:
   - Участники, чьи фотографии участвуют в раунде, не голосуют.
   - Все остальные могут проголосовать за одну из двух фотографий. 🗳️

4️⃣ Итоги раунда:
   - Фото с наибольшим количеством голосов продолжает участие в игре.
   - Проигравший пользователь выбывает 🙅‍♂️

🏆 Цель игры:  
Остаться в игре как можно дольше и стать победителем! 🎉

🚀 Готовы начать?
"""

IDLE_WITH_KEYBOARD_MESSAGE = """
⌨️ Готово! Теперь у вас есть клавиатура для взаимодействия.

✨ С её помощью вы сможете:  
- Быстро принимать решения 🕹  
- Голосовать 🗳  
- Получать подсказки и участвовать в заданиях 🔮  

📢 Используйте кнопки ниже, чтобы начать игру, либо получить информацию о последней игре. Удачи! 🚀
"""  # noqa: E501

IDLE_WAITING_MESSAGE = "⏳ Ожидание начала игры..."

IDLE_LAST_GAME_MESSAGE = """
🏁 Итоги последней игры 🎉

✨ Победитель: 🏆 {username}  
🔥 Он набрал максимальное количество очков и стал лидером игры!  
"""

IDLE_NONE_GAMES = """
📭 Ещё не было сыграно ни одной игры!

✨ Вы можете стать первым, кто начнёт историю побед и достижений! 🚀  
"""

IDLE_UNKNOWN_COMMAND = """
❌ Неизвестная команда!

🙃 Я не понимаю, что вы имели в виду.  
Попробуйте написать:  
- 🛠 /help — список всех команд  
"""

IDLE_START_GAME_MESSAGE = """
⏳ Ожидание начала игры...
"""

MAIN_KEYBOARD = {
    "one_time": True,
    "buttons": [
        [
            {
                "action": {
                    "type": "callback",
                    "payload": '{"button": "start_game"}',
                    "label": "Начать игру",
                },
                "color": "positive",
            }
        ],
        [
            {
                "action": {
                    "type": "callback",
                    "payload": '{"button": "get_last_game"}',
                    "label": "Показать последнюю игру",
                },
                "color": "secondary",
            }
        ],
    ],
}

NEW_GAME_WARNING_MESSAGE = """
❌ Ошибка: для начала игры нужно хотя бы трое игроков!

👥 Игра не может начаться с двумя участниками. Пожалуйста, добавьте ещё игроков, чтобы начать игру.  
🕹 Чем больше участников, тем интереснее игра! 🚀
"""  # noqa: E501

NEW_GAME_PERMISSION_MESSAGE = """
❌ Я не могу создать для вас игру! 😔

🔒 Для этого мне нужны права администратора.  
Без них я не могу видеть ваши аватарки и управлять игровыми процессами.

✨ Что нужно сделать:
1️⃣ Добавьте меня в администраторы чата.  
2️⃣ Убедитесь, что у меня есть доступ к чтению сообщений и информации об участниках.
"""  # noqa: E501

ROUND_START_MESSAGE = """
🎮 {current_round} раунд начинается! ⏳

🗳 Голосование доступно для всех участников, кроме авторов этих фотографий.
Выберите фото, которое вам нравится больше! 💖
"""

GAME_PROCESSING_START_VOTING = """
✨ На голосование выставляются две аватарки:

1️⃣ Фото от {username1}
2️⃣ Фото от {username2}
"""

GAME_PROCESSING_WINNER_MESSAGE = """
🏆 Победитель раунда! 🎉

✨ В этом раунде победу одержало фото от {winner}!  
🎯 Голоса распределились следующим образом:
- {winner} — {winner_votes} голосов
- {loser} — {loser_votes} голосов

🔥 Отличная игра! Не останавливайтесь, следующий раунд уже близко!  
Продолжайте участвовать и выигрывать! 🚀

⏳ Ожидайте начала следующего раунда...
"""

GAME_PROCESSING_TIE_MESSAGE = """
🤝 Ничья! ⚖️

✨ В этом раунде голоса распределились поровну:
- Фото от {username1} — {votes1} голосов
- Фото от {username2} — {votes2} голосов

🔄 Раунд не принес победителя, но не переживайте, игра продолжается!  
Давайте попробуем ещё раз! 🚀

⏳ Следующий раунд скоро начнётся...
"""

GAME_PROCESSING_VOTE_WARNING_MESSAGE = """
❗ {username}, Вы уже проголосовали или участвуете в этом раунде! ⛔

✨ Если вы являетесь автором одной из фотографий, вы не можете голосовать в этом раунде.  
✔️ Если вы уже проголосовали, спасибо за участие! Вы не можете голосовать повторно в этом раунде.

⏳ Ожидайте следующего раунда и будьте готовы! 🚀
"""  # noqa: E501

GAME_FINISHED_END_MESSAGE = """
🛑 Игра завершена!

✨ Спасибо всем участникам за участие в игре. Это было увлекательно! 🎉

💡 Итоги:
- 🥇 Победитель: {username}
- 🎮 Все участники показали свои лучшие результаты!

🔥 Надеемся, вам понравилось! Возвращайтесь, чтобы испытать удачу и навыки снова. 🚀  

До встречи в следующей игре! 👋
"""  # noqa: E501
